huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
        bool gesture = false;
        if (event == TOUCH_SLIDER_EVENT_LEFT_SWIPE || event == TOUCH_SLIDER_EVENT_RIGHT_SWIPE) {
            gesture = true;
        } else if (event == TOUCH_SLIDER_EVENT_RELEASE) {
            gesture = true;
        }

        if (!gesture) {
            return;
        }

        // The outer capacitive surface is a feedback-only "pet" input.
        self->HandleOuterTouchPet();
    }

    void EnterEmotionLearningMode()
    {
        if (mode_ == Mode::EmotionLearning) {
            return;
        }
        EnterMode(Mode::EmotionLearning);
        current_emotion_index_ = 0;
        ShowEmotionLearningCurrent();
        // Play sound to indicate entering learning mode
        auto& audio = Application::GetInstance().GetAudioService();
        audio.PlaySound(Lang::Sounds::OGG_POPUP);
        vTaskDelay(pdMS_TO_TICKS(150));
        audio.PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Entered emotion learning mode");
    }

    void ExitEmotionLearningMode()
    {
        if (mode_ != Mode::EmotionLearning) {
            return;
        }
        ExitToChat();
        ShowTemporaryEmotion("happy", 2000);
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Exited emotion learning mode");
    }

    void ShowEmotionLearningCurrent()
    {
        if (display_ != nullptr) {
            const char* emotion = kEmotionLearningEmotions_[current_emotion_index_];
            display_->SetEmotion(emotion);
            ESP_LOGI(TAG, "Emotion: %s (%s)", emotion, kEmotionLearningNames_[current_emotion_index_]);
        }
    }

    void ShowEmotionLearningNext()
    {
        current_emotion_index_ = (current_emotion_index_ + 1) % kEmotionLearningCount;
        ShowEmotionLearningCurrent();
    }

    void EnterYogaChallengeMode()
    {
        if (mode_ == Mode::Yoga) {
            return;
        }
        EnterMode(Mode::Yoga);
        current_pose_index_ = 0;
        ShowYogaPose();
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Entered yoga challenge mode");
    }

    void ExitYogaChallengeMode()
    {
        if (mode_ != Mode::Yoga) {
            return;
        }
        ExitToChat();
        ShowTemporaryEmotion("happy", 2000);
        ESP_LOGI(TAG, "Exited yoga challenge mode");
    }

    void ShowYogaPose()
    {
        if (display_ != nullptr) {
            const char* direction = kYogaPoseDirections_[current_pose_index_];
            // Use DrawArrow to directly draw arrow on LCD panel
            static_cast<emote::EmoteDisplay*>(display_)->DrawArrow(direction);
            ESP_LOGI(TAG, "Yoga pose: %s (%s)", kYogaPoseNames_[current_pose_index_], direction);
        }
    }

    void CheckYogaPoseMatch(const char* motion_direction)
    {
        if (mode_ != Mode::Yoga) {
            return;
        }
        const char* target = kYogaPoseDirections_[current_pose_index_];
        if (strcmp(motion_direction, target) == 0) {
            ESP_LOGI(TAG, "Correct! Moving to next pose");
            ShowTemporaryEmotion("happy", 1000);
            Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
            current_pose_index_ = (current_pose_index_ + 1) % kYogaPoseCount;
            vTaskDelay(pdMS_TO_TICKS(500));
            ShowYogaPose();
        }
    }

    void ProcessImuForYoga()
    {
        if (mode_ != Mode::Yoga || !bmi270_ready_) {
            return;
        }
        static int64_t last_check_ms = 0;
        constexpr int64_t kCooldownMs = 500;  // Only check every 500ms
        int64_t now_ms = esp_timer_get_time() / 1000;
        if (now_ms - last_check_ms < kCooldownMs) {
            return;
        }
        last_check_ms = now_ms;

        // Read accelerometer data
        struct bmi2_sens_data data = {};
        if (Bmi270Motion::ReadAccelRaw(data)) {
            // Determine tilt direction
            int acc_x = data.acc.x;
            int acc_y = data.acc.y;
            const char* direction = nullptr;
            // Check dominant tilt
            if (abs(acc_x) > abs(acc_y)) {
                if (acc_x > 5000) {
                    direction = "right";
                } else if (acc_x < -5000) {
                    direction = "left";
                }
            } else {
                if (acc_y > 5000) {
                    direction = "down";
                } else if (acc_y < -5000) {
                    direction = "up";
                }
            }
            if (direction != nullptr) {
                CheckYogaPoseMatch(direction);
            }
        }
    }

    static void touch_button_event_callback(touch_button_handle_t handle, uint32_t channel, touch_state_t state, void* cb_arg)
    {
        (void)handle;
        (void)channel;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }

        // Single-pad (PCB v1.0) outer capacitive surface: a touch is recognized
        // once per debounced interaction, on release. It is feedback-only (Pet)
        // and never changes mode, toggles chat, advances an emotion, or records
        // a drink.
        if (state == TOUCH_STATE_INACTIVE) {
            self->HandleOuterTouchPet();
        }
    }

    static void touch_cap_poll_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr) {
                if (self->touch_slider_handle_ != nullptr) {
                    touch_slider_sensor_handle_events(self->touch_slider_handle_);
                } else if (self->touch_button_handle_ != nullptr) {
                    touch_button_sensor_handle_events(self->touch_button_handle_);
                }
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
    }

    void InitializeCapacitiveTouchPads()
    {
        if (TOUCH_PAD1 == GPIO_NUM_NC) {
            ESP_LOGW(TAG, "Capacitive touch disabled: TOUCH_PAD1 NC");
            return;
        }

        const uint32_t ch1 = TouchChannelFromPadGpio(TOUCH_PAD1);
        if (ch1 == 0) {
            ESP_LOGW(TAG, "TOUCH_PAD1 GPIO %d is not a touch channel (expect GPIO1..GPIO14)", (int)TOUCH_PAD1);
            return;
        }

